app/Utils/Helper/helpers.php

function settings($settings, $updateCache = false)
{
    // Check what settings you want
    switch ($settings) {

        case 'currency':

            // Check if want to update cache
            if ($updateCache) {

                // Remove it from cache
                Cache::forget('settings_currency');

            } else {

                // Return data
                return Cache::rememberForever('settings_currency', function () {
                    return SettingsCurrency::first();
---
select * from `settings_currency` limit 1


                // Return data
                return Cache::rememberForever('settings_footer', function () {
                    return SettingsFooter::first();
---
select * from `settings_footer` limit 1


                // Return data
                return Cache::rememberForever('settings_general', function () {
                    return SettingsGeneral::first();
---
select * from `settings_general` limit 1


                // Return data
                return Cache::rememberForever('settings_seo', function () {
                    return SettingsSeo::with('ogimage')->first();
---
select * from `settings_seo` limit 1


                // Return data
                return Cache::rememberForever('settings_newsletter', function () {
                    return NewsletterSettings::first();
---
select * from `newsletter_settings` limit 1


                // Return data
                return Cache::rememberForever('settings_blog', function () {
                    return BlogSettings::first();
---
select * from `blog_settings` limit 1


                // Return data
                return Cache::rememberForever('settings_appearance', function () {
                    return SettingsAppearance::with('placeholder')->first();
---
select * from `settings_appearance` limit 1


                // Return data
                return Cache::rememberForever('settings_hero', function () {
                    return SettingsHero::with(['background_large', 'background_medium', 'background_small'])->first();
---
select * from `settings_hero` limit 1

function supported_languages($clear_cache = false)
{
    // Check if want to clear cache
    if ($clear_cache) {

        // Clear old cache
        Cache::forget('supported_languages');

        // Return data
        return Cache::rememberForever('supported_languages', function () {
            return Language::where('is_active', true)->orderBy('name', 'asc')->get();
        });

    } else {

        // Return data
        return Cache::rememberForever('supported_languages', function () {
            return Language::where('is_active', true)->orderBy('name', 'asc')->get();
---
select * from `languages` where `is_active` = 1 order by `name` asc

function advertisements($name = null, $updateCache = false)
{
    // Check if want to update cache
    if ($updateCache) {

        // Clear old cache
        Cache::forget('advertisements');

        // Save ads
        Cache::rememberForever('advertisements', function () {
            return Advertisement::first();
        });

    } else {

        // Get ads
        $ads = Cache::rememberForever('advertisements', function () {
            return Advertisement::first();
---
select * from `advertisements` limit 1